IlleniumDillon/MM32LLD/MM32/Sfr/MM32_I2CReg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-12-11 15:28:04
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-12-11 15:29:29
 * @FilePath: \CODE\MM32\Sfr\MM32_I2CReg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_I2CREG_H_
#define _MM32_I2CREG_H_

#include "MM32_RegBase.h"

#include "MM32_I2CRegDef.h"

#define MOUDLE_I2C1		((MM32_I2C*)I2C1_BASE)

#define MOUDLE_I2C2		((MM32_I2C*)I2C2_BASE)

#define I2C1_CR		((MM32_I2C_CR*)(I2C1_BASE+0X00))

#define I2C1_TAR		((MM32_I2C_TAR*)(I2C1_BASE+0X04))

#define I2C1_SAR		((MM32_I2C_SAR*)(I2C1_BASE+0X08))

#define I2C1_DR		((MM32_I2C_DR*)(I2C1_BASE+0X10))

#define I2C1_SSHR		((MM32_I2C_SSHR*)(I2C1_BASE+0X14))

#define I2C1_SSLR		((MM32_I2C_SSLR*)(I2C1_BASE+0X18))

#define I2C1_FSHR		((MM32_I2C_FSHR*)(I2C1_BASE+0X1C))

#define I2C1_FSLR		((MM32_I2C_FSLR*)(I2C1_BASE+0X20))

#define I2C1_ISR		((MM32_I2C_ISR*)(I2C1_BASE+0X2C))

#define I2C1_IMR		((MM32_I2C_IMR*)(I2C1_BASE+0X30))

#define I2C1_RAWISR		((MM32_I2C_RAWISR*)(I2C1_BASE+0X34))

#define I2C1_RXTLR		((MM32_I2C_RXTLR*)(I2C1_BASE+0X38))

#define I2C1_TXTLR		((MM32_I2C_TXTLR*)(I2C1_BASE+0X3C))

#define I2C1_ICR		((MM32_I2C_ICR*)(I2C1_BASE+0X40))

#define I2C1_RX_UNDER		((MM32_I2C_RX_UNDER*)(I2C1_BASE+0X44))

#define I2C1_RX_OVER		((MM32_I2C_RX_OVER*)(I2C1_BASE+0X48))

#define I2C1_TX_OVER		((MM32_I2C_TX_OVER*)(I2C1_BASE+0X4C))

#define I2C1_RD_REQ		((MM32_I2C_RD_REQ*)(I2C1_BASE+0X50))

#define I2C1_TX_ABRT		((MM32_I2C_TX_ABRT*)(I2C1_BASE+0X54))

#define I2C1_RX_DONE		((MM32_I2C_RX_DONE*)(I2C1_BASE+0X58))

#define I2C1_ACTIV		((MM32_I2C_ACTIV*)(I2C1_BASE+0X5C))

#define I2C1_STOP		((MM32_I2C_STOP*)(I2C1_BASE+0X60))

#define I2C1_START		((MM32_I2C_START*)(I2C1_BASE+0X64))

#define I2C1_GC		((MM32_I2C_GC*)(I2C1_BASE+0X68))

#define I2C1_ENR		((MM32_I2C_ENR*)(I2C1_BASE+0X6C))

#define I2C1_SR		((MM32_I2C_SR*)(I2C1_BASE+0X70))

#define I2C1_TXFLR		((MM32_I2C_TXFLR*)(I2C1_BASE+0X74))

#define I2C1_RXFLR		((MM32_I2C_RXFLR*)(I2C1_BASE+0X78))

#define I2C1_HOLD		((MM32_I2C_HOLD*)(I2C1_BASE+0X7C))

#define I2C1_DMA		((MM32_I2C_DMA*)(I2C1_BASE+0X88))

#define I2C1_SETUP		((MM32_I2C_SETUP*)(I2C1_BASE+0X94))

#define I2C1_GCR		((MM32_I2C_GCR*)(I2C1_BASE+0X98))

#define I2C1_SLVMASK		((MM32_I2C_SLVMASK*)(I2C1_BASE+0XB0))

#define I2C1_SLVRCVADDR		((MM32_I2C_SLVRCVADDR*)(I2C1_BASE+0XB4))

#define I2C2_CR		((MM32_I2C_CR*)(I2C2_BASE+0X00))

#define I2C2_TAR		((MM32_I2C_TAR*)(I2C2_BASE+0X04))

#define I2C2_SAR		((MM32_I2C_SAR*)(I2C2_BASE+0X08))

#define I2C2_DR		((MM32_I2C_DR*)(I2C2_BASE+0X10))

#define I2C2_SSHR		((MM32_I2C_SSHR*)(I2C2_BASE+0X14))

#define I2C2_SSLR		((MM32_I2C_SSLR*)(I2C2_BASE+0X18))

#define I2C2_FSHR		((MM32_I2C_FSHR*)(I2C2_BASE+0X1C))

#define I2C2_FSLR		((MM32_I2C_FSLR*)(I2C2_BASE+0X20))

#define I2C2_ISR		((MM32_I2C_ISR*)(I2C2_BASE+0X2C))

#define I2C2_IMR		((MM32_I2C_IMR*)(I2C2_BASE+0X30))

#define I2C2_RAWISR		((MM32_I2C_RAWISR*)(I2C2_BASE+0X34))

#define I2C2_RXTLR		((MM32_I2C_RXTLR*)(I2C2_BASE+0X38))

#define I2C2_TXTLR		((MM32_I2C_TXTLR*)(I2C2_BASE+0X3C))

#define I2C2_ICR		((MM32_I2C_ICR*)(I2C2_BASE+0X40))

#define I2C2_RX_UNDER		((MM32_I2C_RX_UNDER*)(I2C2_BASE+0X44))

#define I2C2_RX_OVER		((MM32_I2C_RX_OVER*)(I2C2_BASE+0X48))

#define I2C2_TX_OVER		((MM32_I2C_TX_OVER*)(I2C2_BASE+0X4C))

#define I2C2_RD_REQ		((MM32_I2C_RD_REQ*)(I2C2_BASE+0X50))

#define I2C2_TX_ABRT		((MM32_I2C_TX_ABRT*)(I2C2_BASE+0X54))

#define I2C2_RX_DONE		((MM32_I2C_RX_DONE*)(I2C2_BASE+0X58))

#define I2C2_ACTIV		((MM32_I2C_ACTIV*)(I2C2_BASE+0X5C))

#define I2C2_STOP		((MM32_I2C_STOP*)(I2C2_BASE+0X60))

#define I2C2_START		((MM32_I2C_START*)(I2C2_BASE+0X64))

#define I2C2_GC		((MM32_I2C_GC*)(I2C2_BASE+0X68))

#define I2C2_ENR		((MM32_I2C_ENR*)(I2C2_BASE+0X6C))

#define I2C2_SR		((MM32_I2C_SR*)(I2C2_BASE+0X70))

#define I2C2_TXFLR		((MM32_I2C_TXFLR*)(I2C2_BASE+0X74))

#define I2C2_RXFLR		((MM32_I2C_RXFLR*)(I2C2_BASE+0X78))

#define I2C2_HOLD		((MM32_I2C_HOLD*)(I2C2_BASE+0X7C))

#define I2C2_DMA		((MM32_I2C_DMA*)(I2C2_BASE+0X88))

#define I2C2_SETUP		((MM32_I2C_SETUP*)(I2C2_BASE+0X94))

#define I2C2_GCR		((MM32_I2C_GCR*)(I2C2_BASE+0X98))

#define I2C2_SLVMASK		((MM32_I2C_SLVMASK*)(I2C2_BASE+0XB0))

#define I2C2_SLVRCVADDR		((MM32_I2C_SLVRCVADDR*)(I2C2_BASE+0XB4))

#endif